In [4]:
import pandas as pd

In [5]:
# 2 Main Data Types
Series =  pd.Series(["BMW", "HONDA", "TOYOTA"])

In [6]:
Series

0       BMW
1     HONDA
2    TOYOTA
dtype: object

In [7]:
Colours = pd.Series(["Red", "Green", "Blue"])

In [8]:
#DataFrame (2D Array)
Car_Data = pd.DataFrame({"CarBrand": Series, "CarColor": Colours})

In [9]:
Car_Data

  CarBrand CarColor
0      BMW      Red
1    HONDA    Green
2   TOYOTA     Blue

In [10]:
#ImportData
Car_Sales = pd.read_csv("car-sales.csv")

In [11]:
Car_Sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

##DescribeData

In [13]:
#Attribute\
Car_Sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [14]:
Car_Sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [15]:
Car_Sales.index

RangeIndex(start=0, stop=10, step=1)

In [16]:
Car_Sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [17]:
Car_Sales.mean()

TypeError: Could not convert ['ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyotaNissan'
 'WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite'
 '$4,000.00$5,000.00$7,000.00$22,000.00$3,500.00$4,500.00$7,500.00$7,000.00$6,250.00$9,700.00'] to numeric

In [18]:
Car_Sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [20]:
Car_Sales["Doors"].sum()

40

In [21]:
len(Car_Sales)

10

## View and Select Data

In [24]:
##Return first 5
Car_Sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [25]:
Car_Sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [26]:
Car_Sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [29]:
# .loc & iloc
animals = pd.Series(["cat", "dog", "bird", "panda", "snake" ], index=[0,3,9,8,3])

In [30]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [32]:
#loc refer to Index
animals.loc[3]

3      dog
3    snake
dtype: object

In [33]:
Car_Sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [36]:
#iloc refer to position top to bottom
animals.iloc[3]

'panda'

In [37]:
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [38]:
animals.iloc[3:]

8    panda
3    snake
dtype: object

In [40]:
# Get col with a filter
Car_Sales[Car_Sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00